app/auth/authenticate_user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ivan.guerra@email.com"], ["LIMIT", 1]]
---
    def user
      user = User.find_by(email: email)