app/controllers/courses_controller.rb

    def create
        @create = Course.create!(course_params)
---
INSERT INTO "courses" ("courseId", "shortName", "name", "credits", "time", "days", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["courseId", "1"], ["shortName", "test"], ["name", "Test"], ["credits", 1], ["time", 1], ["days", "MT"], ["created_at", "2019-10-02 14:22:46.395489"], ["updated_at", "2019-10-02 14:22:46.395489"]]