app/controllers/degrees_controller.rb

SELECT "degrees".* FROM "degrees"
---
    def index
        @degrees = Degree.all

INSERT INTO "degrees" ("major", "minor", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["major", "Test"], ["minor", "test"], ["created_at", "2019-10-02 14:31:40.788121"], ["updated_at", "2019-10-02 14:31:40.788121"]]
---
    def create
        @degree = Degree.create!(degree_params)