app/controllers/students_controller.rb

    def index
        @students = Student.all
---
SELECT "students".* FROM "students" WHERE "students"."studentId" = $1 LIMIT $2  [["studentId", "1"], ["LIMIT", 1]]

    def create
        @student = Student.create!(todo_params)
---
INSERT INTO "students" ("studentId", "firstName", "lastName", "dob", "address", "schoolName", "startDate", "projectedEd", "gpa", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"